FemDesign.Model
Model. Represents a complete struxml model.

FemDesign.Model.StruxmlVersion
The actual struXML version;  should be equal to the schema version the xml file is conformed to.

FemDesign.Model.SourceSoftware
Name of the StruSoft or 3rd party product what generated this XML file.

FemDesign.Model.StartTime
The data is partial data, so the oldest entity latest modification date and time is the
value in UTC. If the current XML contains the whole database, the start_time value is
"1970-01-01T00:00:00Z". The date and time always in UTC!

FemDesign.Model.EndTime
The data is partial data, so the newest entity latest modification date and time is this
value in UTC. This date and time always in UTC!

FemDesign.Model.Standard
Calculation code

FemDesign.Model.Country
National annex of calculation code

FemDesign.Model.#ctor
Parameterless constructor for serialization.

FemDesign.Model.#ctor(FemDesign.Country,System.Collections.Generic.List{FemDesign.GenericClasses.IStructureElement},System.Collections.Generic.List{FemDesign.GenericClasses.ILoadElement},System.Collections.Generic.List{FemDesign.Loads.LoadCase},System.Collections.Generic.List{FemDesign.Loads.LoadCombination},System.Collections.Generic.List{FemDesign.Loads.ModelGeneralLoadGroup},FemDesign.ConstructionStages)
Initialize a model with elements.
country: Country/Annex of the FEM-Design model.
elements: Structural elements.
loads: Load elements
loadCases: Load cases
loadCombinations: Load combinations
loadGroups: Load groups

FemDesign.Model.DeserializeFromFilePath(System.String)
Deserialize model from file (.struxml).

FemDesign.Model.SerializeModel(System.String)
Serialize Model to file (.struxml).
filePath:

FemDesign.Model.ReadStr(System.String,System.Collections.Generic.IEnumerable{System.Type},System.Boolean,System.Boolean,System.Boolean)
Reads a .str model, then saves and deserialize it from file (.struxml).
strPath: FEM-Design model (.str) to be read.
resultTypes: Results that should be read. (Might require model to have been analysed)
killProcess:
endSession:
checkOpenFiles:

FemDesign.Model.Open(System.String,System.Boolean)
Open a Model in FemDesign
filePath: if null, the file will be created in the current directory with the name "myModel.struxml"
closeOpenWindows:

FemDesign.Model.SerializeToString
Serialize Model to string.

FemDesign.Model.AddEntities(System.Collections.Generic.List{FemDesign.Bars.Bar},System.Collections.Generic.List{FemDesign.ModellingTools.FictitiousBar},System.Collections.Generic.List{FemDesign.Shells.Slab},System.Collections.Generic.List{FemDesign.ModellingTools.FictitiousShell},System.Collections.Generic.List{FemDesign.Shells.Panel},System.Collections.Generic.List{FemDesign.Cover},System.Collections.Generic.List{System.Object},System.Collections.Generic.List{FemDesign.Loads.LoadCase},System.Collections.Generic.List{FemDesign.Loads.LoadCombination},System.Collections.Generic.List{FemDesign.GenericClasses.ISupportElement},System.Collections.Generic.List{FemDesign.StructureGrid.Storey},System.Collections.Generic.List{FemDesign.StructureGrid.Axis},System.Collections.Generic.List{FemDesign.Loads.ModelGeneralLoadGroup},System.Boolean)
Add entities to Model.

FemDesign.Model.AddBar(FemDesign.Bars.Bar,System.Boolean)
Add Bar to Model.

FemDesign.Model.BarInModel(FemDesign.Bars.Bar)
Check if Bar in Model.

FemDesign.Model.AddBarPtcs(FemDesign.Bars.Bar,System.Boolean)
Add BarReinforcement(s) from Bar to Model.

FemDesign.Model.AddPtc(FemDesign.Reinforcement.Ptc,System.Boolean)
Add Post-tensioned cable to Model.

FemDesign.Model.AddFictBar(FemDesign.ModellingTools.FictitiousBar,System.Boolean)
Add Fictitious Bar to Model.

FemDesign.Model.FictBarInModel(FemDesign.ModellingTools.FictitiousBar)
Check if Fictitious Bar in Model.

FemDesign.Model.AddFictShell(FemDesign.ModellingTools.FictitiousShell,System.Boolean)
Add Fictitious Shell to Model.

FemDesign.Model.FictShellInModel(FemDesign.ModellingTools.FictitiousShell)
Check if Fictitious Bar in Model.

FemDesign.Model.AddComplexSection(FemDesign.Sections.ComplexSection,System.Boolean)
Add ComplexSection (from Bar) to Model.

FemDesign.Model.ComplexSectionInModel(FemDesign.Sections.ComplexSection)
Check if ComplexSection in Model.

FemDesign.Model.AddCompositeSection(StruSoft.Interop.StruXml.Data.Complex_composite_type,System.Boolean)
Check if CompositeSection in Model.

FemDesign.Model.AddComplexComposite(StruSoft.Interop.StruXml.Data.Complex_composite_type,System.Boolean)
Add ComplexComposite to Model.
if ComplexComposite is present, also compositeSection will be created

FemDesign.Model.AddCover(FemDesign.Cover,System.Boolean)
Add Cover to Model.

FemDesign.Model.CoverInModel(FemDesign.Cover)
Check if Cover in Model.

FemDesign.Model.AddDiaphragm(FemDesign.ModellingTools.Diaphragm,System.Boolean)
Add Fictitious Shell to Model.

FemDesign.Model.DiaphragmInModel(FemDesign.ModellingTools.Diaphragm)
Check if Fictitious Bar in Model.

FemDesign.Model.AddLoad(System.Object,System.Boolean)
Add Load to Model.
obj: PointLoad, LineLoad, PressureLoad, SurfaceLoad

FemDesign.Model.AddPanel(FemDesign.Shells.Panel,System.Boolean)
Add Panel to Model.

FemDesign.Model.PanelInModel(FemDesign.Shells.Panel)
Check if Panel in Model.

FemDesign.Model.AddPointLoad(FemDesign.Loads.PointLoad,System.Boolean)
Add PointLoad to Model.

FemDesign.Model.PointLoadInModel(FemDesign.Loads.PointLoad)
Check if PointLoad in Model.

FemDesign.Model.AddLineLoad(FemDesign.Loads.LineLoad,System.Boolean)
Add LineLoad to Model.

FemDesign.Model.LineLoadInModel(FemDesign.Loads.LineLoad)
Check if LineLoad in Model.

FemDesign.Model.AddLineTemperatureLoad(FemDesign.Loads.LineTemperatureLoad,System.Boolean)
Add LineTemperatureLoad to Model.

FemDesign.Model.LineTemperatureLoadInModel(FemDesign.Loads.LineTemperatureLoad)
Check if LineTemperatureLoad in Model.

FemDesign.Model.AddPressureLoad(FemDesign.Loads.PressureLoad,System.Boolean)
Add PressureLoad to Model.

FemDesign.Model.PressureLoadInModel(FemDesign.Loads.PressureLoad)
Check if PressureLoad in Model.

FemDesign.Model.AddSurfaceLoad(FemDesign.Loads.SurfaceLoad,System.Boolean)
Add SurfaceLoad to Model.

FemDesign.Model.SurfaceLoadInModel(FemDesign.Loads.SurfaceLoad)
Check if SurfaceLoad in Model.

FemDesign.Model.AddSurfaceTemperatureLoad(FemDesign.Loads.SurfaceTemperatureLoad,System.Boolean)
Add SurfaceTemperatureLoad to Model.

FemDesign.Model.SurfaceTemperatureLoadInModel(FemDesign.Loads.SurfaceTemperatureLoad)
Check if SurfaceLoad in Model.

FemDesign.Model.AddMassConversionTable(FemDesign.Loads.MassConversionTable)
Add MassConversionTable to Model.
MassConversionTable is always overwritten.

FemDesign.Model.AddFootfall(FemDesign.Loads.Footfall,System.Boolean)
Add Footfall to Model.

FemDesign.Model.FootfallInModel(FemDesign.Loads.Footfall)
Check if Footfall in Model.

FemDesign.Model.AddLoadCase(FemDesign.Loads.LoadCase,System.Boolean)
Add LoadCase to Model.

FemDesign.Model.LoadCaseInModel(FemDesign.Loads.LoadCase)
Check if LoadCase in Model.

FemDesign.Model.LoadCaseNameTaken(FemDesign.Loads.LoadCase)
Check if LoadCase name is in use in Model.

FemDesign.Model.CheckCombItems
Check if any load combination has a combItem object.
if it does throw exception if not all of them has a combItem.
Either only combItems or no combItems :)

FemDesign.Model.AddLoadGroupTable(System.Collections.Generic.List{FemDesign.Loads.ModelGeneralLoadGroup},System.Boolean)
Add LoadGroupTable to Model.

FemDesign.Model.AddLoadCombination(FemDesign.Loads.LoadCombination,System.Boolean)
Add LoadCombination to Model.

FemDesign.Model.LoadCombinationInModel(FemDesign.Loads.LoadCombination)
Check if LoadCombination in Model.

FemDesign.Model.LoadGroupTableInModel
Check if the model already has a load group table

FemDesign.Model.LoadCombinationNameTaken(FemDesign.Loads.LoadCombination)
Check if LoadCombination name is in use in Model.

FemDesign.Model.AddSlab(FemDesign.Shells.Slab,System.Boolean)
Add Slab to Model.

FemDesign.Model.SlabInModel(FemDesign.Shells.Slab)
Check if Slab in Model.

FemDesign.Model.AddReinforcingMaterial(FemDesign.Materials.Material,System.Boolean)
Add Material (reinforcing) to Model.

FemDesign.Model.ReinforcingMaterialInModel(FemDesign.Materials.Material)
Check if Material (reinforcring) in Model.

FemDesign.Model.AddPredefinedRigidity(FemDesign.Releases.RigidityDataLibType3,System.Boolean)
Add predefined rigidity

FemDesign.Model.PredefRigidityInModel(FemDesign.Releases.RigidityDataLibType3)
Check if Material (reinforcring) in Model.

FemDesign.Model.AddStructureGrid(System.Object,System.Boolean)
Add StructureGrid (axis or storey) to model.
obj: Axis, Storey

FemDesign.Model.AddAxis(FemDesign.StructureGrid.Axis,System.Boolean)
Add axis to entities.
obj: Axis.

FemDesign.Model.AxisInModel(FemDesign.StructureGrid.Axis)
Check if axis in entities.
obj: Axis.
Returns:

FemDesign.Model.AddStorey(FemDesign.StructureGrid.Storey,System.Boolean)
Add Storey to Model.
obj: Storey.

FemDesign.Model.StoreyInModel(FemDesign.StructureGrid.Storey)
Check if storey in entities.
obj: Storey.
Returns:

FemDesign.Model.ConsistenStoreyGeometry(FemDesign.StructureGrid.Storey)
Check if geometry of storey is consistent with geometry of storeys aldread added.
Storey origo should share XY-coordinates. Z-coordinate should be unique.
Storey direction should be identical.
obj:

FemDesign.Model.AddBarReinforcements(FemDesign.Bars.Bar,System.Boolean)
Add BarReinforcement(s) from Bar to Model.

FemDesign.Model.AddBarReinforcement(FemDesign.Reinforcement.BarReinforcement,System.Boolean)
Add BarReinforcement to Model.

FemDesign.Model.BarReinforcementInModel(FemDesign.Reinforcement.BarReinforcement)
Check if BarReinforcement in Model.
obj:
Returns:

FemDesign.Model.AddSurfaceReinforcements(FemDesign.Shells.Slab,System.Boolean)
Add SurfaceReinforcement(s) from Slab to Model.
obj:

FemDesign.Model.AddSurfaceReinforcement(FemDesign.Reinforcement.SurfaceReinforcement,System.Boolean)
Add SurfaceReinforcement to Model.

FemDesign.Model.SurfaceReinforcementInModel(FemDesign.Reinforcement.SurfaceReinforcement)
Check if SurfaceReinforcement in Model.
obj:
Returns:

FemDesign.Model.AddSurfaceReinforcementParameters(FemDesign.Shells.Slab,System.Boolean)
Add SurfaceReinforcementParameters to Model.

FemDesign.Model.SurfaceReinforcementParametersInModel(FemDesign.Reinforcement.SurfaceReinforcementParameters)
Check if SurfaceReinforcementParameters in Model.
obj:
Returns:

FemDesign.Model.AddSupport(FemDesign.GenericClasses.ISupportElement,System.Boolean)
Add Support to Model
obj: PointSupport, LineSupport or SurfaceSupport

FemDesign.Model.AddPointSupport(FemDesign.Supports.PointSupport,System.Boolean)
Add PointSupport to Model.

FemDesign.Model.AddPointSupportGroupLibItem(FemDesign.Releases.RigidityDataLibType2,System.Boolean)
Add predefined point support rigidity to model

FemDesign.Model.PointSupportInModel(FemDesign.Supports.PointSupport)
Check if PointSupport in Model.

FemDesign.Model.AddLineSupport(FemDesign.Supports.LineSupport,System.Boolean)
Add LineSupport to Model.

FemDesign.Model.LineSupportInModel(FemDesign.Supports.LineSupport)
Check if LineSupport in Model.

FemDesign.Model.AddLineSupportGroupLibItem(FemDesign.Releases.RigidityDataLibType2,System.Boolean)
Add predefined line support rigidity to model

FemDesign.Model.AddSurfaceSupport(FemDesign.Supports.SurfaceSupport,System.Boolean)
Add SurfaceSupport to Model.

FemDesign.Model.SurfaceSupportInModel(FemDesign.Supports.SurfaceSupport)
Check if SurfaceSupport in Model.

FemDesign.Model.AddSurfaceSupportLibItem(FemDesign.Releases.RigidityDataLibType1,System.Boolean)
Add predefined surface support rigidity to model

FemDesign.Model.AddMaterial(FemDesign.Materials.Material,System.Boolean)
Add Material to Model.

FemDesign.Model.MaterialInModel(FemDesign.Materials.Material)
Check if Material in Model.

FemDesign.Model.AddTimberPanelLibraryType(FemDesign.Materials.OrthotropicPanelLibraryType,System.Boolean)
Add Timber panel library type to Model.

FemDesign.Model.TimberPanelLibraryTypeInModel(FemDesign.Materials.OrthotropicPanelLibraryType)
Check if Timber panel library type in Model.

FemDesign.Model.AddCltPanelLibraryType(FemDesign.Materials.CltPanelLibraryType,System.Boolean)
Add Clt panel library type to Model.

FemDesign.Model.CltPanelLibraryTypeInModel(FemDesign.Materials.CltPanelLibraryType)
Check if Clt panel library type in Model.

FemDesign.Model.AddGlcPanelLibraryType(FemDesign.Materials.GlcPanelLibraryType,System.Boolean)
Add Glc panel library type to Model.

FemDesign.Model.GlcPanelLibraryTypeInModel(FemDesign.Materials.GlcPanelLibraryType)
Check if Glc panel library type in Model.

FemDesign.Model.AddSection(FemDesign.Sections.Section,System.Boolean)
Add Section to Model.

FemDesign.Model.SectionInModel(FemDesign.Sections.Section)
Check if Section in Model.

FemDesign.Model.AddLabelledSection(FemDesign.AuxiliaryResults.LabelledSection,System.Boolean)
Add LabelledSection to Model

FemDesign.Model.LabelledSectionInModel(FemDesign.AuxiliaryResults.LabelledSection)
Check if LabelledSection in Model

FemDesign.Model.AddElements``1(System.Collections.Generic.IEnumerable{``0},System.Boolean)
Add structural elements to Model.
Structural elements (IStructureElement).
elements: Structural elements to be added.
overwrite:
Returns:

FemDesign.Model.AddLoads``1(System.Collections.Generic.IEnumerable{``0},System.Boolean)
Adds loads to the model.
ILoadElement is any load object in FEM-Design.
elements: Load elements to be added.
overwrite:
Returns:

FemDesign.Model.AddSupports``1(System.Collections.Generic.IEnumerable{``0},System.Boolean)
Add supports to the model.
ISuppotElement is any support object.
elements: Support elements to be added.
overwrite:
Returns:

FemDesign.Model.GetBars
Get Bars from Model.
Bars will be reconstructed from Model incorporating all references: ComplexSection, Section, Material.

FemDesign.Model.GetFictitiousShells
Get FictitiousShells from Model.
FicititiousShells will be reconstruted from Model incorporating predefined EdgeConnections
Returns:

FemDesign.Model.GetSlabs
Get Slabs from Model.
Slabs will be reconstruted from Model incorporating all references: Material, Predefined EdgeConnections, SurfaceReinforcementParameters, SurfaceReinforcement.
Returns: